Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection.Number Property
 Gets or sets a value of the property Number.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Number { get; set; }
Public Property Number As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ProfileItemCrossSection Class
Tekla.Structures.Catalogs Namespace